test_cases/kOmegaSST_of22_v0/system/sampleLines
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

_sampler
{
    type                    sets;
    libs                    (sampling);
    setFormat               csv;
    interpolationScheme     cellPointFace;
    writeControl            onEnd;
    enabled                 false;

    sets
    (
        inlet    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-2000 0 0);
            end         (-2000 0 1000);
        }

        incident   // incident
        {
            type        midPoint;
            axis        z;
            start       (0 0 0);
            end         (0 0 1000);
        }

        x_0    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-2000 0 0);
            end         (-2000 0 1000);
        }

        x_200    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-1800 0 0);
            end         (-1800 0 1000);
        }

        x_400    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-1600 0 0);
            end         (-1600 0 1000);
        }


        x_600    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-1400 0 0);
            end         (-1400 0 1000);
        }


        x_800    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-1200 0 0);
            end         (-1200 0 1000);
        }

        x_1000    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-1000 0 0);
            end         (-1000 0 1000);
        }

        x_1200    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-800 0 0);
            end         (-800 0 1000);
        }

        x_1400    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-600 0 0);
            end         (-600 0 1000);
        }

        x_1600    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-400 0 0);
            end         (-400 0 1000);
        }

        x_1800    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-200 0 0);
            end         (-200 0 1000);
        }

        x_2000    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (0 0 0);
            end         (0 0 1000);
        }



    );
}

samples_u
{
    ${_sampler}
    fields                  (U);
    enabled                 true;
}

samples_k
{
    ${_sampler}
    fields                  (k);
    enabled                 true;
}

// samples_epsilon
// {
//     ${_sampler}
//     fields                  (epsilon);
//     enabled                 true;
// }

samples_omega
{
    ${_sampler}
    fields                  (omega);
    enabled                 true;
}

samples_nut
{
    ${_sampler}
    fields                  (nut);
    enabled                 true;
}


// *********************************************************************** //
